### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [2]:
# File to Load (Remember to Change These)
file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file)

df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
#Per Alexander's suggestion, we need to do an info of the Data Frame created
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [4]:
#Per Alexander's suggestion, we should always do a shape of the data frame
df.shape

(780, 7)

* Display the total number of players

In [5]:
#This is the total number of Players by Screen_Names (SN)
df.SN.nunique()

576

In [6]:
#Creating Summary One data frame
ttl_plyrs = df.SN.nunique()

Smmry1 = pd.DataFrame()
Smmry1["Total Players"] = [ttl_plyrs]

Smmry1

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
##Displaying data frame for Purchasing Analysis(Total)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [8]:
#Obtain number of unique items
df["Item ID"].nunique()

179

In [9]:
#Dollars
#Obtain average price with Price column to decimal places.  Source:https://www.analyticsvidhya.com/blog/2021/06/style-your-pandas-dataframe-and-make-it-stunning
df.Price.mean()

3.050987179487176

In [10]:
#Dolalrs 
#Obtain sum of all Purchases
df.Price.sum()

2379.77

In [11]:
#Obtain the total number of Purchases
len(df)

780

In [12]:
#Created Summary Two data frame to hold the results of the four values
ttl_itms = df["Item ID"].nunique()
ttl_rws = len(df)
ttl_prc = df.Price.sum()
avg_prc = df.Price.mean()

#Give the displayed data cleaner formatting
Smmry2 = pd.DataFrame()
Smmry2["Number of of Unique Items"] = [ttl_itms]
Smmry2["Number of Purchases"] = [ttl_rws]
Smmry2["Average Price"] = [avg_prc]
Smmry2["Total Revenue"] = [ttl_prc]

Smmry2

,Number of of Unique Items,Number of Purchases,Average Price,Total Revenue
0,179,780,3.050987,2379.77

## Gender Demographics

In [13]:
#Displaying data frame for Gender Demogrpahics
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [14]:
#Count Players
cols = ["SN", "Age", "Gender"]

plyrs = df.loc[:, cols]
plyrs.head()

              SN  Age Gender
0        Lisim78   20   Male
1    Lisovynya38   40   Male
2     Ithergue48   24   Male
3  Chamassasya86   24   Male
4      Iskosia90   23   Male

In [15]:
#Dropping duplicates b/c one Screen_Name can make several purchases, result is 576 unique rows of data
plyrs = plyrs.drop_duplicates().reset_index(drop=True)
plyrs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SN      576 non-null    object
 1   Age     576 non-null    int64
 2   Gender  576 non-null    object
dtypes: int64(1), object(2)
memory usage: 13.6+ KB

In [16]:
#Group By Gender
plyrs.groupby("Gender").size()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
dtype: int64

In [17]:
#Percentage of Female players
plyrs.groupby("Gender").size()/len(plyrs)

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
dtype: float64

In [18]:
#This sorts it by the VALUE, which is why Male is now on top of list
plyrs.Gender.value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [19]:
#Percentages 
#This sorts it by the VALUE of percentages, which is why Male is now on top of list
plyrs.Gender.value_counts() / len(plyrs)

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [20]:
#Percentages
#Creating two columns (Total Count and % of Players) by GroupBy of Gender
#Note - Order here is by numerical value and not alphabetize, which is why Male row is top of the list becuase it has the higher values.
plyr_cnt = plyrs.Gender.value_counts()
print()
plyr_prcnt = plyrs.Gender.value_counts() / len(plyrs)
print()
# This is concatenating two series - Source: https://stackoverflow.com/a/18062521
Smmry3 = pd.concat([plyr_cnt, plyr_prcnt], axis=1)
Smmry3.columns = ["Total Count", 'Percentage of Players']

Smmry3

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [21]:
#Percentages
##Note - Order here is different b/c it is alphabetized and not on Value Count, which is Female is top of
plyr_cnt = plyrs.groupby("Gender").size()
plyr_prcnt = plyrs.groupby("Gender").size() / len(plyrs)

Smmry3 = pd.concat([plyr_cnt, plyr_prcnt], axis=1)
Smmry3.columns = ["Total Count", 'Percentage of Players']

Smmry3

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [22]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [23]:
#Doing a groupby using the "agg" function per Alexander's suggestion - #Source:  https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.core.groupby.DataFrameGroupBy.agg.html
df.groupby("Gender").agg({"Purchase ID": "count", "Price": "mean"})

                       Purchase ID     Price
Gender
Female                         113  3.203009
Male                           652  3.017853
Other / Non-Disclosed           15  3.346000


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [24]:
#Displaying Purchasing Analysis (Gender)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [25]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [46]:
#Dollar Signs
Smmry4 = df.groupby("Gender").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
Smmry4.columns = ['Purchase Count', "Averag Purchase Price", "Total Purchase Value"]
Smmry4

,Purchase Count,Averag Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [27]:
#These are dollars
Smmry4["Total Purchase Value"] / Smmry3 ["Total Count"]

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [28]:
#Dollars
Smmry4["Average Total Purchase per Person"] = Smmry4["Total Purchase Value"] / Smmry3["Total Count"]
Smmry4

,Purchase ID,Averag Purchase Price,Total Purchase Value,Average Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [29]:
df.groupby("Gender")["Purchase ID"].count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [30]:
#Percentages
counts = df.groupby("Gender")["Purchase ID"].count()
df.groupby("Gender")["Price"].mean()

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [31]:
counts = df.groupby("Gender")["Purchase ID"].count()
avrgs = df.groupby("Gender")["Price"].mean()
ttls = df.groupby("Gender")["Price"].sum()

pd.concat([counts, avrgs, ttls], axis=1)

                       Purchase ID     Price    Price
Gender
Female                         113  3.203009   361.94
Male                           652  3.017853  1967.64
Other / Non-Disclosed           15  3.346000    50.19

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [32]:
#Displaying dataframe for Purchase Analysis (Aging)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [33]:
#Creating bins to place values
bins = [0,9,14,19,24,29,34,9999999]

#Creating Labels for the Bins
group_labels = ["<10","10-14","15-19","20-24","25-29","30-34","40+"]

In [35]:
pd.cut(df.Age, bins, labels=group_labels, include_lowest=True)

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (7, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '40+']

In [36]:
df.tail()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [37]:
df["Age Group"] = pd.cut(df.Age, bins, labels=group_labels, include_lowest=True)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [38]:
df.groupby("Age Group").Age.max()

Age Group
<10       9
10-14    14
15-19    19
20-24    24
25-29    29
30-34    34
40+      45
Name: Age, dtype: int64

In [39]:
df.groupby("Age Group").Age.min()

Age Group
<10       7
10-14    10
15-19    15
20-24    20
25-29    25
30-34    30
40+      35
Name: Age, dtype: int64

In [40]:
cols = ["SN", "Age", "Gender", "Age Group"]

plyrs = df.loc[:, cols]
plyrs.head()

              SN  Age Gender Age Group
0        Lisim78   20   Male     20-24
1    Lisovynya38   40   Male       40+
2     Ithergue48   24   Male     20-24
3  Chamassasya86   24   Male     20-24
4      Iskosia90   23   Male     20-24

In [41]:
#Droppiing Duplicates
plyrs = plyrs.drop_duplicates().reset_index(drop=True)
plyrs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   SN         576 non-null    object
 1   Age        576 non-null    int64
 2   Gender     576 non-null    object
 3   Age Group  576 non-null    category
dtypes: category(1), int64(1), object(2)
memory usage: 14.5+ KB

In [45]:
#Percentages
plyr_cnt = plyrs.groupby("Age Group").size()
plyr_prcnt = plyrs.groupby("Age Group").size() / len(plyrs)

# This is concatenating two series - Source: https://stackoverflow.com/a/18062521
Smmry5 = pd.concat([plyr_cnt, plyr_prcnt], axis=1)
Smmry5.columns = ["Total Count", 'Percentage of Players']

Smmry5

           Total Count  Percentage of Players
Age Group
<10                 17               0.029514
10-14               22               0.038194
15-19              107               0.185764
20-24              258               0.447917
25-29               77               0.133681
30-34               52               0.090278
40+                 43               0.074653

In [47]:
Smmry6 = df.groupby("Age Group").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
Smmry6.columns = ['Purchase Count', "Averag Purchase Price", "Total Purchase Value"]
Smmry6

           Purchase Count  Averag Purchase Price  Total Purchase Value
Age Group
<10                    23               3.353478                 77.13
10-14                  28               2.956429                 82.78
15-19                 136               3.035956                412.89
20-24                 365               3.052219               1114.06
25-29                 101               2.900990                293.00
30-34                  73               2.931507                214.00
40+                    54               3.442778                185.91

In [49]:
#Dollars 
Smmry6["Average Total Purchase per Person"] = Smmry6["Total Purchase Value"] / Smmry5["Total Count"]
Smmry6

,Purchase Count,Averag Purchase Price,Total Purchase Value,Average Total Purchase per Person
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
40+,54,3.442778,185.91,4.323488

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [60]:
#Dollars
Smmry7 = df.groupby("SN").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
Smmry7.columns = ['Purchase Count', "Averag Purchase Price", "Total Purchase Value"]
#Per Alexander's tutelage
Smmry7.sort_values(by="Total Purchase Value", ascending=False, inplace=True)
Smmry7.head()

             Purchase Count  Averag Purchase Price  Total Purchase Value
SN
Lisosia93                 5               3.792000                 18.96
Idastidru52               4               3.862500                 15.45
Chamjask73                3               4.610000                 13.83
Iral74                    4               3.405000                 13.62
Iskadarya95               3               4.366667                 13.10

In [53]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame